## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                          NAME                                           |
|--------|-----------------------------------------------------------------------------------------|
| add    | `aws_identitystore_group.articles_production_access_vpc_clientvpn`                      |
|        | `aws_identitystore_group.articles_production_admin`                                     |
|        | `aws_identitystore_group.articles_production_read_only`                                 |
|        | `aws_identitystore_group.articles_staging_access_vpc_clientvpn`                         |
|        | `aws_identitystore_group.articles_staging_admin`                                        |
|        | `aws_identitystore_group.articles_staging_read_only`                                    |
|        | `aws_ssoadmin_account_assignment.articles[&quot;Articles-Production-Admin-472286471787&quot;]`    |
|        | `aws_ssoadmin_account_assignment.articles[&quot;Articles-Production-Admin-762579868088&quot;]`    |
|        | `aws_ssoadmin_account_assignment.articles[&quot;Articles-Production-ReadOnly-472286471787&quot;]` |
|        | `aws_ssoadmin_account_assignment.articles[&quot;Articles-Production-ReadOnly-762579868088&quot;]` |
|        | `aws_ssoadmin_account_assignment.articles[&quot;Articles-Staging-Admin-729164266357&quot;]`       |
|        | `aws_ssoadmin_account_assignment.articles[&quot;Articles-Staging-ReadOnly-729164266357&quot;]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group.articles_production_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "articles_production_access_vpc_clientvpn" {
      + description       = "Grants members access to the GC Articles Production Client VPN."
      + display_name      = "Articles-Production-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_production_admin will be created
  + resource "aws_identitystore_group" "articles_production_admin" {
      + description       = "Grants members administrator access to the GC Articles Production account."
      + display_name      = "Articles-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_production_read_only will be created
  + resource "aws_identitystore_group" "articles_production_read_only" {
      + description       = "Grants members read-only access to the GC Articles Production account."
      + display_name      = "Articles-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_staging_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "articles_staging_access_vpc_clientvpn" {
      + description       = "Grants members access to the GC Articles Staging Client VPN."
      + display_name      = "Articles-Staging-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_staging_admin will be created
  + resource "aws_identitystore_group" "articles_staging_admin" {
      + description       = "Grants members administrator access to the GC Articles Staging account."
      + display_name      = "Articles-Staging-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_staging_read_only will be created
  + resource "aws_identitystore_group" "articles_staging_read_only" {
      + description       = "Grants members read-only access to the GC Articles Staging account."
      + display_name      = "Articles-Staging-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.articles["Articles-Production-Admin-472286471787"] will be created
  + resource "aws_ssoadmin_account_assignment" "articles" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "472286471787"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.articles["Articles-Production-Admin-762579868088"] will be created
  + resource "aws_ssoadmin_account_assignment" "articles" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "762579868088"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.articles["Articles-Production-ReadOnly-472286471787"] will be created
  + resource "aws_ssoadmin_account_assignment" "articles" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "472286471787"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.articles["Articles-Production-ReadOnly-762579868088"] will be created
  + resource "aws_ssoadmin_account_assignment" "articles" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "762579868088"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.articles["Articles-Staging-Admin-729164266357"] will be created
  + resource "aws_ssoadmin_account_assignment" "articles" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "729164266357"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.articles["Articles-Staging-ReadOnly-729164266357"] will be created
  + resource "aws_ssoadmin_account_assignment" "articles" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "729164266357"
      + target_type        = "AWS_ACCOUNT"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
